In [1]:
import pandas as pd

In [3]:
people = {
    "first": ["Corney", "Jane", "Dima"], 
    "second": ["Spiler", "Doe", "Markow"], 
    "email" : ["ssd@", "sdfd@", "gbbhn@"]
}

In [4]:
df = pd.DataFrame(people)
df #DataFrame is a list of Series

    first  second   email
0  Corney  Spiler    ssd@
1    Jane     Doe   sdfd@
2    Dima  Markow  gbbhn@

In [7]:
s = df["first"] #to get access to the whole column -> return Series (list of date)

In [9]:
s

0    Corney
1      Jane
2      Dima
Name: first, dtype: object

In [8]:
type(s)

pandas.core.series.Series

In [10]:
df.email #the same result

0      ssd@
1     sdfd@
2    gbbhn@
Name: email, dtype: object

In [13]:
df[["first", "second"]] #multiple comumns

    first  second
0  Corney  Spiler
1    Jane     Doe
2    Dima  Markow

In [14]:
df.columns #-> list of column's names

Index(['first', 'second', 'email'], dtype='object')

In [15]:
df.iloc[0] #integer location -> first row

first     Corney
second    Spiler
email       ssd@
Name: 0, dtype: object

In [16]:
df.iloc[[0, 2]] #-> dataframe of multiple rows

    first  second   email
0  Corney  Spiler    ssd@
2    Dima  Markow  gbbhn@

In [18]:
df.iloc[[0, 2], 2] #to get 2 column of two rows (iloc accepts only integers as indexes)

0      ssd@
2    gbbhn@
Name: email, dtype: object

In [19]:
df

    first  second   email
0  Corney  Spiler    ssd@
1    Jane     Doe   sdfd@
2    Dima  Markow  gbbhn@

In [20]:
df.loc[0] #->first row

first     Corney
second    Spiler
email       ssd@
Name: 0, dtype: object

In [21]:
df.loc[[1, 2]]

  first  second   email
1  Jane     Doe   sdfd@
2  Dima  Markow  gbbhn@

In [22]:
df.loc[[1, 2], "second"] #get second name from two columns

1       Doe
2    Markow
Name: second, dtype: object

In [23]:
df.loc[[1, 2], ["first", "second"]] #-> first and second name for 2 rows

  first  second
1  Jane     Doe
2  Dima  Markow